app/controllers/notice_controller.rb

SELECT "accounts".* FROM "accounts"
---
	def login
		@@correct=[]
		@testacc = Account.all
		@insertid = params[:identification]
		@insertpwd = params[:password]
		@testacc.each do |testacc|

SELECT "posts".* FROM "posts"
---
	def home
		@post = Post.all

INSERT INTO "posts" ("title", "description", "writer", "password", "subject", "time") VALUES (?, ?, ?, ?, ?, ?)  [["title", "213"], ["description", "213"], ["writer", "1"], ["password", "1"], ["subject", "언매"], ["time", "2022-05-05 14:26:19"]]
---
	def create
		post = Post.new
		post.subject = params[:subject]
		post.title = params[:title]
		post.description = params[:description]
		@time = Time.now.to_s
		post.time = @time.slice(0..18)
		post.writer = @@correct[0]
		post.password = @@correct[1]
		post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def update
		@subject = @@subject
		@post = Post.find(params[:postId])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "time" = ? WHERE "posts"."id" = ?  [["description", "123123123231sd"], ["time", "2022-05-05 14:27:17"], ["id", 4]]
---
	def update_action
		@id = params[:id]
		post = Post.find(@id)
		post.title = params[:title]
		post.subject = params[:subject]
		post.description = params[:description]
		@time = Time.now.to_s
		post.time = @time.slice(0..18)
		post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
	def read
		@post = Post.find(params[:postId])

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
---
	def delete
		Post.destroy(params[:postId])